music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "bts"], ["created_at", "2019-09-06 00:39:49.618594"], ["updated_at", "2019-09-06 00:39:49.618594"]]
---
  def create
    # debugger
    @band = Band.new(band_params)
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "aaa Jonas Brothers"], ["updated_at", "2019-09-06 00:31:44.278444"], ["id", 1]]
---
  def update

    band = Band.find(params[:id])
    band.update(band_params)